app/controllers/alarms_controller.rb

SELECT "alarms".* FROM "alarms"
---
  def index
    @alarms = Alarm.all

INSERT INTO "alarms" ("name", "reason", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "HEY"], ["reason", "Come outside"], ["created_at", "2017-11-09 18:24:10.968730"], ["updated_at", "2017-11-09 18:24:10.968730"]]
---
  def create
    @alarm = Alarm.new(alarm_params)
    require "net/http"
    require "uri"

    respond_to do |format|
      if @alarm.save

SELECT  "alarms".* FROM "alarms" WHERE "alarms"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def set_alarm
      @alarm = Alarm.find(params[:id])